/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error_parse.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ctragula <ctragula@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/19 11:43:16 by ctragula          #+#    #+#             */
/*   Updated: 2021/03/19 12:03:21 by ctragula         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 
** @params: char *str обрабатываемая строка
**			t_list processes список команд в баше
** TODO добавляет новый список команд в список 
** @return: int корректность выполнения команды
*/
int
	error_parse(char *str)
{
	printf("minishell: %s", str);
	return (0);
}